/*
    quiz-el.c : Μικρό παιχνίδι ερωτήσεων/απαντήσεων για τη γλώσσα προγραμματισμού C!
    Κυριάκος, 24/4/2020
*/

#include <stdio.h>

// Μεταβλητές που συγκρατούν τον αριθμό των ερωτήσεων και τον αριθμό των σωστών απαντήσεων
unsigned short int question_number = 0;
unsigned short int correct_answers = 0;

// Δείτε το σχόλιο στον ορισμό της quiz() μετά απ' τη main()
void quiz(const char *question, const char *answer_1, const char *answer_2, const char *answer_3, const char *answer_4, const unsigned short int answer);

int main(void)
{
    printf("\nΚαλωσήλθατε στο παιχνίδι για τη γλώσσα C! Επιλέξτε από το 1 μέχρι το 4\n");

    // Αρχίζουμε τις ερωτήσεις!

    quiz("Ποιος και πότε δημιούργησε τη γλώσσα C;", \
         "Ο Linus Torvalds το 1991", \
         "Ο Dennis Ritchie το 1972", \
         "Ο Bjarne Stroustrup το 1985", \
         "Ο Bill Gates το 1975", \
         2);

    quiz("Ένα αρχείο κεφαλίδας:", \
         "Περιέχει δηλώσεις που μπορούν να χρησιμοποιηθούν από τον υπόλοιπο κώδικα", \
         "Περιέχει τον αντικειμενικό κώδικα του προγράμματος", \
         "Περιέχει οδηγίες σχετικά με το πως λειτουργεί ο μεταγλωττιστής", \
         "Περιέχει απλώς κάποια σχόλια σχετικά με το πως λειτουργεί το πρόγραμμα", \
         1);

    quiz("Τι είναι μια συνάρτηση main();", \
         "Εκτυπώνει τα περιεχόμενα της μνήμης που χρησιμοποιεί το πρόγραμμα", \
         "Είναι μια συνάρτηση που την ορίζει αν θέλει ο προγραμματιστής", \
         "Δεν είναι συνάρτηση, είναι καθολική μεταβλητή", \
         "Είναι η συνάρτηση που καλείται πάντα πρώτη κατά την εκκίνηση του προγράμ.", \
         4);

    quiz("Σε τι χρησιμεύει το void πριν το όνομα στον ορισμό μιας συνάρτησης;", \
         "Δείχνει ότι η συνάρτηση επιστρέφει για τιμή έναν χαρακτήρα", \
         "Δείχνει ότι το πρόγραμμα είναι για τη γλώσσα C++", \
         "Δείχνει ότι η συνάρτηση δεν επιστρέφει κάποια τιμή", \
         "Δείχνει ότι η συνάρτηση επιστρέφει έναν δείκτη", \
         3);

    quiz("Tι κάνει το for(;;) {.. } ;", \
         "Είναι βρόχος που επαναλαμβάνει τις εντολές που ακολουθούν μόνο δύο φορές", \
         "Είναι βρόχος που εκτελεί την εντολή που ακολουθεί μόνο μία φορά", \
         "Είναι βρόχος που επαναλαμβάνει συνέχεια τις εντολές που ακολουθούν", \
         "Είναι βρόχος που αποκλείει τις εντολές που ακολουθούν", \
         3);

    quiz("Tι είναι ένας δείκτης στη C;", \
         "Είναι μεταβλητή που έχει για τιμή την διεύθυνση μνήμης μιας άλλης μεταβλ.", \
         "Είναι μεταβλητή τύπου χαρακτήρα", \
         "Είναι μεταβλητή γενικού τύπου", \
         "Είναι μεταβλητή που χρησιμοποιείται για αποθήκευση πραγματικών αριθμών", \
         1);

    quiz("Σε τι χρησιμεύει η συνάρτηση malloc();", \
         "Τυπώνει στην κονσόλα διάφορες πληροφορίες για τη μνήμη", \
         "Εκχωρεί τη ζητούμενη μνήμη για χρήση μέσω κάποιου δείκτη", \
         "Διαγράφει τα περιεχόμενα της μνήμης", \
         "Είναι garbage collector", \
         2);

    quiz("Το union:", \
         "Συνενώνει αλφαριθμητικά", \
         "Συνενώνει δομές", \
         "Είναι πίνακας ειδικού τύπου για χρήση μόνο ακέραιων αριθμών", \
         "Αποθηκεύει διαφορετικούς τύπους δεδομένων στην ίδια περιοχή μνήμης", \
         4);

    // Εκτυπώνουμε τον αριθμό τον σωστών απάντησεων

    printf("\nΑπαντήσατε σωστά σε %u από τις %u ερωτήσεις!\n\n", correct_answers, question_number);

    return 0;
}

/* Συνάρτηση που θέτει την ερώτηση, τις πιθανές απαντήσεις 1 μέχρι 4, συγκρατεί τον αριθμό της
   σωστής απάντησης, δέχεται είσοδο απ' τον χρήστη και απαντάει σ' αυτόν το αποτέλεσμα */
void quiz(const char *question, const char *answer_1, const char *answer_2, const char *answer_3, const char *answer_4, const unsigned short int answer)
{
    // Στη μεταβλητή αυτή θα αποθηκεύσουμε αργότερα την επιλογή του χρήστη
    short int user_answer;

    // Τυπώνουμε την ερώτηση και τις πιθανές απαντήσεις
    printf("\n%s\n\n 1. %s\n 2. %s\n 3. %s\n 4. %s\n\n", question, answer_1, answer_2, answer_3, answer_4);

    // Ζητάμε από τον χρήστη την απάντηση και την αποθηκεύουμε στη μεταβλητή
    scanf("%1d", &user_answer);

    // Είναι η απάντηση που έδωσε ο χρήστης σωστή ή λάθος; Εκτυπώνουμε την απάντηση
    if(user_answer == answer) {
        printf("\nΣωστά!\n\n");
        // Απάντησε σωστά οπότε αυξάνουμε κατά ένα τη μεταβλητή με τον αριθμό σωστών απαντήσεων
        correct_answers++;
    }
    else {
        printf("\nΛάθος, το σωστό είναι το %u\n\n", answer);
    }

    // Αυξάνουμε τη μεταβλητή που κρατάει των αριθμό των ερωτήσεων
    question_number++;
}
